print("1---------------:", 'Hello,world!')
# 这是注释
'''
这是多行注释
'''
"""
这也是多行注释
"""
print("2---------------:", type(2 / 2))
# 除法
print("3---------------:", 2 / 2)
# 除法取整
print("4---------------:", 2 // 2)
# 二进制
print("5---------------:", 0b10)
print("6---------------:", 0b11)
# 八进制
print("7---------------:", 0o11)
# 十六进制
print("8---------------:", 0x10)
# 不同进制之间的转换
# 转换为二进制
print("9---------------:", bin(3))
# 转换为 8进制
print("12---------------:", oct(30))
# 转换为 10进制
print("10---------------:", int(0b101))
# 转换为16进制
print("11---------------:", hex(20))
print('12---------------:', 0b1000 < 7)
print("13---------------:", type(True))
